# Introduction to Pandas Lab

Complete the following set of exercises to solidify your knowledge of Pandas fundamentals.

### 1. Import Numpy and Pandas and alias them to `np` and `pd` respectively.

In [1]:
import pandas as pd
import numpy as np

### 2. Create a Pandas Series containing the elements of the list below.

In [2]:
lst = [5.7, 75.2, 74.4, 84.0, 66.5, 66.3, 55.8, 75.7, 29.1, 43.7]

In [3]:
myseries = pd.Series(lst)
myseries

0     5.7
1    75.2
2    74.4
3    84.0
4    66.5
5    66.3
6    55.8
7    75.7
8    29.1
9    43.7
dtype: float64

### 3. Use indexing to return the third value in the Series above.

*Hint: Remember that indexing begins at 0.*

In [4]:
indexing_third_value = pd.Series(lst)
indexing_third_value[2]

74.4

### 4. Create a Pandas DataFrame from the list of lists below. Each sublist should be represented as a row.

In [5]:
b = [[53.1, 95.0, 67.5, 35.0, 78.4],
     [61.3, 40.8, 30.8, 37.8, 87.6],
     [20.6, 73.2, 44.2, 14.6, 91.8],
     [57.4, 0.1, 96.1, 4.2, 69.5],
     [83.6, 20.5, 85.4, 22.8, 35.9],
     [49.0, 69.0, 0.1, 31.8, 89.1],
     [23.3, 40.7, 95.0, 83.8, 26.9],
     [27.6, 26.4, 53.8, 88.8, 68.5],
     [96.6, 96.4, 53.4, 72.4, 50.1],
     [73.7, 39.0, 43.2, 81.6, 34.7]]

In [6]:
c = pd.DataFrame(b)
c

      0     1     2     3     4
0  53.1  95.0  67.5  35.0  78.4
1  61.3  40.8  30.8  37.8  87.6
2  20.6  73.2  44.2  14.6  91.8
3  57.4   0.1  96.1   4.2  69.5
4  83.6  20.5  85.4  22.8  35.9
5  49.0  69.0   0.1  31.8  89.1
6  23.3  40.7  95.0  83.8  26.9
7  27.6  26.4  53.8  88.8  68.5
8  96.6  96.4  53.4  72.4  50.1
9  73.7  39.0  43.2  81.6  34.7

### 5. Rename the data frame columns based on the names in the list below.

In [7]:
b = [[53.1, 95.0, 67.5, 35.0, 78.4],
     [61.3, 40.8, 30.8, 37.8, 87.6],
     [20.6, 73.2, 44.2, 14.6, 91.8],
     [57.4, 0.1, 96.1, 4.2, 69.5],
     [83.6, 20.5, 85.4, 22.8, 35.9],
     [49.0, 69.0, 0.1, 31.8, 89.1],
     [23.3, 40.7, 95.0, 83.8, 26.9],
     [27.6, 26.4, 53.8, 88.8, 68.5],
     [96.6, 96.4, 53.4, 72.4, 50.1],
     [73.7, 39.0, 43.2, 81.6, 34.7]]

In [8]:
colnames = ['Score_1', 'Score_2', 'Score_3', 'Score_4', 'Score_5']

In [9]:
# renaming data frame columns

renaming_data = pd.DataFrame(b, columns = colnames)
print(renaming_data.columns)

Index(['Score_1', 'Score_2', 'Score_3', 'Score_4', 'Score_5'], dtype='object')

In [10]:
# we check if it is correct getting the data frame

print(renaming_data)

   Score_1  Score_2  Score_3  Score_4  Score_5
0     53.1     95.0     67.5     35.0     78.4
1     61.3     40.8     30.8     37.8     87.6
2     20.6     73.2     44.2     14.6     91.8
3     57.4      0.1     96.1      4.2     69.5
4     83.6     20.5     85.4     22.8     35.9
5     49.0     69.0      0.1     31.8     89.1
6     23.3     40.7     95.0     83.8     26.9
7     27.6     26.4     53.8     88.8     68.5
8     96.6     96.4     53.4     72.4     50.1
9     73.7     39.0     43.2     81.6     34.7

### 6. Create a subset of this data frame that contains only the Score 1, 3, and 5 columns.

In [11]:
renaming_data[['Score_1','Score_3', 'Score_5']]

   Score_1  Score_3  Score_5
0     53.1     67.5     78.4
1     61.3     30.8     87.6
2     20.6     44.2     91.8
3     57.4     96.1     69.5
4     83.6     85.4     35.9
5     49.0      0.1     89.1
6     23.3     95.0     26.9
7     27.6     53.8     68.5
8     96.6     53.4     50.1
9     73.7     43.2     34.7

### 7. From the original data frame, calculate the average Score_3 value.

In [12]:
renaming_data.describe() #numerical columns

        Score_1   Score_2    Score_3    Score_4    Score_5
count  10.00000  10.00000  10.000000  10.000000  10.000000
mean   54.62000  50.11000  56.950000  47.280000  63.250000
std    25.64899  32.12204  30.168278  31.393446  24.562313
min    20.60000   0.10000   0.100000   4.200000  26.900000
25%    32.95000  29.55000  43.450000  25.050000  39.450000
50%    55.25000  40.75000  53.600000  36.400000  69.000000
75%    70.60000  72.15000  80.925000  79.300000  85.300000
max    96.60000  96.40000  96.100000  88.800000  91.800000

In [13]:
renaming_data["Score_3"].mean()

56.95000000000001

### 8. From the original data frame, calculate the maximum Score_4 value.

In [14]:
renaming_data["Score_4"].max()

88.8

### 9. From the original data frame, calculate the median Score 2 value.

In [15]:
renaming_data["Score_2"].median()

40.75

### 10. Create a Pandas DataFrame from the dictionary of product orders below.

In [16]:
orders = {'Description': ['LUNCH BAG APPLE DESIGN',
  'SET OF 60 VINTAGE LEAF CAKE CASES ',
  'RIBBON REEL STRIPES DESIGN ',
  'WORLD WAR 2 GLIDERS ASSTD DESIGNS',
  'PLAYING CARDS JUBILEE UNION JACK',
  'POPCORN HOLDER',
  'BOX OF VINTAGE ALPHABET BLOCKS',
  'PARTY BUNTING',
  'JAZZ HEARTS ADDRESS BOOK',
  'SET OF 4 SANTA PLACE SETTINGS'],
 'Quantity': [1, 24, 1, 2880, 2, 7, 1, 4, 10, 48],
 'UnitPrice': [1.65, 0.55, 1.65, 0.18, 1.25, 0.85, 11.95, 4.95, 0.19, 1.25],
 'Revenue': [1.65, 13.2, 1.65, 518.4, 2.5, 5.95, 11.95, 19.8, 1.9, 60.0]}

In [17]:
product_orders = pd.DataFrame(orders)
product_orders

                          Description  Quantity  UnitPrice  Revenue
0              LUNCH BAG APPLE DESIGN         1       1.65     1.65
1  SET OF 60 VINTAGE LEAF CAKE CASES         24       0.55    13.20
2         RIBBON REEL STRIPES DESIGN          1       1.65     1.65
3   WORLD WAR 2 GLIDERS ASSTD DESIGNS      2880       0.18   518.40
4    PLAYING CARDS JUBILEE UNION JACK         2       1.25     2.50
5                      POPCORN HOLDER         7       0.85     5.95
6      BOX OF VINTAGE ALPHABET BLOCKS         1      11.95    11.95
7                       PARTY BUNTING         4       4.95    19.80
8            JAZZ HEARTS ADDRESS BOOK        10       0.19     1.90
9       SET OF 4 SANTA PLACE SETTINGS        48       1.25    60.00

### 11. Calculate the total quantity ordered and revenue generated from these orders.

In [18]:
total_quantity = product_orders["Quantity"].sum()
print(total_quantity)

2978

In [19]:
total_revenue = product_orders["Revenue"].sum()
print(total_revenue)

637.0

### 12. Obtain the prices of the most expensive and least expensive items ordered and print the difference.

In [20]:
most_expensive = product_orders["UnitPrice"].max()
least_expensive = product_orders["UnitPrice"].min()
print(most_expensive)
print(least_expensive)

11.95
0.18

In [21]:
print(most_expensive - least_expensive)

11.77

## Let's load another dataset for more exercisesº

In [22]:
# Run this code:
admissions = pd.read_csv('../Admission_Predict.csv')
#to remove trailing spaces at the end of the column names
admissions.columns = admissions.columns.str.rstrip()

Let's evaluate the dataset by looking at the `head` function.

In [23]:
admissions.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,316,104,3,3.0,3.5,8.00,1,0.72
2,3,322,110,3,3.5,2.5,8.67,1,0.80
3,4,314,103,2,2.0,3.0,8.21,0,0.65
4,5,330,115,5,4.5,3.0,9.34,1,0.90

### 1 - Before beginning to work with this dataset and evaluating graduate admissions data, we will verify that there is no missing data in the dataset. Do this in the cell below.

In [24]:
pd.isnull(admissions).values.any()

False

###  2 -  Interestingly, there is a column that uniquely identifies the applicants. This column is the serial number column. Instead of having our own index, we should make this column our index. Do this in the cell below. Keep the column in the dataframe in addition to making it an index.

In [25]:
admissions.reset_index(inplace=True)

In [26]:
admissions.set_index("Serial No.", inplace=True) #you need to add inplace, othewise changes are not saved

"Turns out that GRE Score and CGPA also uniquely identify the data. Show this in the cell below."

In [27]:
admissions.duplicated(subset=["GRE Score", "CGPA"]).sum()

0

### 3 - In this part of the lab, we would like to test complex conditions on the entire data set at once. Let's start by finding the number of rows where the CGPA is greater than 9 and the student has performed an investigation.

In [29]:
rslt = admissions[(admissions['CGPA'] > 9) & (admissions['Research'] > 0)]
rslt

,index,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,,
1,0,337,118,4,4.5,4.5,9.65,1,0.92
5,4,330,115,5,4.5,3.0,9.34,1,0.90
11,10,328,112,4,4.0,4.5,9.10,1,0.78
20,19,328,116,5,5.0,5.0,9.50,1,0.94
21,20,334,119,5,5.0,4.5,9.70,1,0.95
...,...,...,...,...,...,...,...,...,...
380,379,329,111,4,4.5,4.0,9.23,1,0.89
381,380,324,110,3,3.5,3.5,9.04,1,0.82
382,381,325,107,3,3.0,3.5,9.11,1,0.84
383,382,330,116,4,5.0,4.5,9.45,1,0.91
385,384,333,117,4,5.0,4.0,9.66,1,0.95

#### 4 - Now return all the rows where the CGPA is greater than 9 and the SOP score is less than 3.5. Find the mean chance of admit for these applicants.

In [30]:
rslt_4 =  admissions[(admissions["CGPA"]> 9) & (admissions["SOP"] < 3.5)]
rslt_4

,index,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,,
29,28,338,118,4,3.0,4.5,9.40,1,0.91
63,62,327,114,3,3.0,3.0,9.02,0,0.61
141,140,326,114,3,3.0,3.0,9.11,1,0.83
218,217,324,111,4,3.0,3.0,9.01,1,0.82
382,381,325,107,3,3.0,3.5,9.11,1,0.84

In [32]:
#find the mean of CHANCE ADMIT

mean_chance = rslt_4['Chance of Admit'].mean()

In [100]:
admissions

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,316,104,3,3.0,3.5,8.00,1,0.72
2,3,322,110,3,3.5,2.5,8.67,1,0.80
3,4,314,103,2,2.0,3.0,8.21,0,0.65
4,5,330,115,5,4.5,3.0,9.34,1,0.90
...,...,...,...,...,...,...,...,...,...
380,381,324,110,3,3.5,3.5,9.04,1,0.82
381,382,325,107,3,3.0,3.5,9.11,1,0.84
382,383,330,116,4,5.0,4.5,9.45,1,0.91
383,384,312,103,3,3.5,4.0,8.78,0,0.67
384,385,333,117,4,5.0,4.0,9.66,1,0.95

Let's create a new column based on the TOEFL Score column, where we put True if the TOEFL value is greater than 100 and False if it is less. We are going to do it with a function and an apply. 
To do this, we first create a function that receives an argument. The function will return True if the parameter entered is greater than 100, otherwise it will return False.

In [121]:
def new_column(i):
    if i > 100:
        return True
    else:
        return False

In [122]:
admissions["New Column"] = admissions["TOEFL Score"].apply(new_column)

In [123]:
admissions

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit,New Column
0,1,337,118,4,4.5,4.5,9.65,1,0.92,True
1,2,316,104,3,3.0,3.5,8.00,1,0.72,True
2,3,322,110,3,3.5,2.5,8.67,1,0.80,True
3,4,314,103,2,2.0,3.0,8.21,0,0.65,True
4,5,330,115,5,4.5,3.0,9.34,1,0.90,True
...,...,...,...,...,...,...,...,...,...,...
380,381,324,110,3,3.5,3.5,9.04,1,0.82,True
381,382,325,107,3,3.0,3.5,9.11,1,0.84,True
382,383,330,116,4,5.0,4.5,9.45,1,0.91,True
383,384,312,103,3,3.5,4.0,8.78,0,0.67,True
384,385,333,117,4,5.0,4.0,9.66,1,0.95,True

Now we create a new column called "Decision" and apply to the TOEFL Score column

In [124]:
admissions["Decision"] = admissions["TOEFL Score"]

In [125]:
admissions

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit,New Column,Decision
0,1,337,118,4,4.5,4.5,9.65,1,0.92,True,118
1,2,316,104,3,3.0,3.5,8.00,1,0.72,True,104
2,3,322,110,3,3.5,2.5,8.67,1,0.80,True,110
3,4,314,103,2,2.0,3.0,8.21,0,0.65,True,103
4,5,330,115,5,4.5,3.0,9.34,1,0.90,True,115
...,...,...,...,...,...,...,...,...,...,...,...
380,381,324,110,3,3.5,3.5,9.04,1,0.82,True,110
381,382,325,107,3,3.0,3.5,9.11,1,0.84,True,107
382,383,330,116,4,5.0,4.5,9.45,1,0.91,True,116
383,384,312,103,3,3.5,4.0,8.78,0,0.67,True,103
384,385,333,117,4,5.0,4.0,9.66,1,0.95,True,117

Create a column called `decision2` in the `admissions` dataframe. Assign 1 to this column if the value of `SOP` is greater than 3 and 0 otherwise.    
HINT (use np.where)

In [127]:
admissions['decision2'] = np.where(admissions['SOP'] > 3, 1, 0)

In [128]:
admissions

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit,New Column,Decision,decision2
0,1,337,118,4,4.5,4.5,9.65,1,0.92,True,118,1
1,2,316,104,3,3.0,3.5,8.00,1,0.72,True,104,0
2,3,322,110,3,3.5,2.5,8.67,1,0.80,True,110,1
3,4,314,103,2,2.0,3.0,8.21,0,0.65,True,103,0
4,5,330,115,5,4.5,3.0,9.34,1,0.90,True,115,1
...,...,...,...,...,...,...,...,...,...,...,...,...
380,381,324,110,3,3.5,3.5,9.04,1,0.82,True,110,1
381,382,325,107,3,3.0,3.5,9.11,1,0.84,True,107,0
382,383,330,116,4,5.0,4.5,9.45,1,0.91,True,116,1
383,384,312,103,3,3.5,4.0,8.78,0,0.67,True,103,1
384,385,333,117,4,5.0,4.0,9.66,1,0.95,True,117,1